Tekla Open API Reference for Tekla Structures 2025
SymbolElement Constructor
Overload List
Name | Description
SymbolElement()
 Creates a new symbol element instance with the default symbol.
SymbolElement(SymbolInfo)
 Creates a new symbol element instance with the given symbol.
SymbolElement(SymbolInfo, DrawingColors, Double)
 Creates a new symbol element instance with the given symbol, color and height.
SymbolElement(SymbolInfo, TeklaDrawingColor, Double)
 Creates a new symbol element instance with the given symbol, the RGB color and height.
Top
See Also
Reference
SymbolElement Class
Tekla.Structures.Drawing Namespace